# Real Estate Sales

## Aim: To predict the Sale Amount in Connecticut US State.

In [267]:
#import required libraries
import pandas as pd
import numpy as np
import seaborn as sns

In [268]:
import warnings
warnings.filterwarnings('ignore')

In [269]:
data_frame=pd.read_csv('modified_data.csv')

In [270]:
data_frame.head()

,Serial Number,List Year,Date Recorded,Town,Address,Assessed Value,Sale Amount,Sales Ratio,Property Type
0,19029,2019,10/31/2019,Ansonia,23 ROBERT BARRY RD,202200.0,284000.0,0.7120,Single Family
1,190189,2019,04/07/2020,Avon,23 RIVER MEAD,134460.0,173800.0,0.7736,Condo
2,190352,2019,08/06/2020,Avon,204 LOVELY STREET,207450.0,317500.0,0.6534,Single Family
3,190033,2019,12/03/2019,Beacon Falls,73 HILLVIEW STREET,111480.0,229900.0,0.4849,Single Family
4,190056,2019,05/13/2020,Bethany,200 RUSSELL DR,323020.0,560000.0,0.5768,Single Family

### Handling missing values

In [272]:
data_frame.isnull().sum()

Serial Number        0
List Year            0
Date Recorded        2
Town                 0
Address             51
Assessed Value       0
Sale Amount          0
Sales Ratio          0
Property Type     4888
dtype: int64

Dropping Null values from the dataframe since they are less in count within the dataset length

In [273]:
data_frame.dropna(axis=0,inplace=True)

In [274]:
data_frame.isnull().sum()

Serial Number     0
List Year         0
Date Recorded     0
Town              0
Address           0
Assessed Value    0
Sale Amount       0
Sales Ratio       0
Property Type     0
dtype: int64

### Handling temporal features

Extracting only Year value from 'Date Recorded' feature

In [275]:
year_recorded=[]
for i in data_frame['Date Recorded']:
    year_recorded.append(int(i[-4:]))

In [276]:
data_frame['Date Recorded']=year_recorded

In [277]:
data_frame.head()

,Serial Number,List Year,Date Recorded,Town,Address,Assessed Value,Sale Amount,Sales Ratio,Property Type
0,19029,2019,2019,Ansonia,23 ROBERT BARRY RD,202200.0,284000.0,0.7120,Single Family
1,190189,2019,2020,Avon,23 RIVER MEAD,134460.0,173800.0,0.7736,Condo
2,190352,2019,2020,Avon,204 LOVELY STREET,207450.0,317500.0,0.6534,Single Family
3,190033,2019,2019,Beacon Falls,73 HILLVIEW STREET,111480.0,229900.0,0.4849,Single Family
4,190056,2019,2020,Bethany,200 RUSSELL DR,323020.0,560000.0,0.5768,Single Family

## Spliting the data into categorical and numerical data

In [278]:
categorical_features=[]
numerical_features=[]
for cols in data_frame.columns:
    if data_frame[cols].dtype=='O':
        categorical_features.append(cols)
    else:
        numerical_features.append(cols)

In [279]:
cat_data_frame=data_frame[categorical_features]
num_data_frame=data_frame[numerical_features]

In [280]:
cat_data_frame.head()

           Town             Address  Property Type
0       Ansonia  23 ROBERT BARRY RD  Single Family
1          Avon       23 RIVER MEAD          Condo
2          Avon   204 LOVELY STREET  Single Family
3  Beacon Falls  73 HILLVIEW STREET  Single Family
4       Bethany      200 RUSSELL DR  Single Family

In [281]:
num_data_frame.head()

,Serial Number,List Year,Date Recorded,Assessed Value,Sale Amount,Sales Ratio
0,19029,2019,2019,202200.0,284000.0,0.7120
1,190189,2019,2020,134460.0,173800.0,0.7736
2,190352,2019,2020,207450.0,317500.0,0.6534
3,190033,2019,2019,111480.0,229900.0,0.4849
4,190056,2019,2020,323020.0,560000.0,0.5768

## Converting the categorical features into numerical features

Performing label encoding

In [282]:
for cols in categorical_features:
    rank=cat_data_frame[cols].value_counts(ascending=True).index
    mapping={i:k for k,i in enumerate(rank,0)}
    cat_data_frame[cols]=cat_data_frame[cols].map(mapping)

In [283]:
cat_data_frame.head()

   Town  Address  Property Type
0    93        0             14
1   124   577418              9
2   124   391996             14
3    47   391995             14
4    41   391994             14

## Handling Numerical data

In [285]:
num_data_frame.head()

,Serial Number,List Year,Date Recorded,Assessed Value,Sale Amount,Sales Ratio
0,19029,2019,2019,202200.0,284000.0,0.7120
1,190189,2019,2020,134460.0,173800.0,0.7736
2,190352,2019,2020,207450.0,317500.0,0.6534
3,190033,2019,2019,111480.0,229900.0,0.4849
4,190056,2019,2020,323020.0,560000.0,0.5768

Modifying temporal features by subtracting them with 2021(Current year)

In [286]:
num_data_frame['Date Recorded']=2021-num_data_frame['Date Recorded']
num_data_frame['List Year']=2021-num_data_frame['List Year']

In [287]:
num_data_frame.head()

,Serial Number,List Year,Date Recorded,Assessed Value,Sale Amount,Sales Ratio
0,19029,2,2,202200.0,284000.0,0.7120
1,190189,2,1,134460.0,173800.0,0.7736
2,190352,2,1,207450.0,317500.0,0.6534
3,190033,2,2,111480.0,229900.0,0.4849
4,190056,2,1,323020.0,560000.0,0.5768

Combining the categorical and numerical data

In [290]:
combined_data=pd.concat([cat_data_frame,num_data_frame],axis=1)

In [291]:
combined_data.head()

,Town,Address,Property Type,Serial Number,List Year,Date Recorded,Assessed Value,Sale Amount,Sales Ratio
0,93,0,14,19029,2,2,202200.0,284000.0,0.7120
1,124,577418,9,190189,2,1,134460.0,173800.0,0.7736
2,124,391996,14,190352,2,1,207450.0,317500.0,0.6534
3,47,391995,14,190033,2,2,111480.0,229900.0,0.4849
4,41,391994,14,190056,2,1,323020.0,560000.0,0.5768

In [292]:
combined_data.to_csv('final_data.csv',index=False)